tests/com/l7tech/service/resources/keyinfothumbreq.xml

<soap:Envelope xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsse11="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<soap:Header>

<wsse:Security soap:mustUnderstand="1">
<wsu:Timestamp wsu:Id="Timestamp"><wsu:Created>2005-08-23T02:38:47.359Z</wsu:Created><wsu:Expires>2005-08-24T02:38:47.359Z</wsu:Expires></wsu:Timestamp>

<ds:Signature><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#Timestamp"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>AQuuioMOMC6lbaAesv2gtWxLxI4=</ds:DigestValue></ds:Reference><ds:Reference URI="#Body"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>gAU27yYTiUcL4AO1mzYcPuUFfMU=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>fPmGNbGnqZNRRyMr2T/Edy5IjS1ix5+6XVV9NEzGyYjloVhEJ3QRk+qlW0JOHMr2zPUJniD5SvO57PQMuBj7vmsC9HogeHyTxvc8PaONpKIX61Yd2fiBL8qA0vU+E8+hhRZSN7rCN8lRdS7986pQkdVc0IIgMPCt1GX2XzVqYr0=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/2005/xx/oasis-2005xx-wss-soap-message-security-1.1#ThumbprintSHA1">bg6I8267h0TUcPYvYE0D6k6+UJQ=</wsse:KeyIdentifier></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soap:Header><soap:Body wsu:Id="Body"><tns:Ping xmlns:tns="http://xmlsoap.org/Ping">Layer 7 Technologies - Scenario #8</tns:Ping></soap:Body></soap:Envelope>